nxp-mcuxpresso/sbl/target/evkmimxrt1170/board/mcu_isp/flexspi_config_MIMXRT1171.c
/*******************************************************************************
 * Codes
 ******************************************************************************/
static void flexspi_jedec_hw_reset(volatile GPIO_Type *gpio, uint32_t cs_pin, uint32_t clk_pin, uint32_t sin_pin)
{
    do
    {
        if (gpio == NULL)
        {
            break;
        }

        bool reset_start = false;
        debug_printf("GPIO_ADDR=%x, cs_pin=%x, clk_pin=%x, sin_pin=%x\n", &gpio->DR, cs_pin, clk_pin, sin_pin);
        gpio->DR_SET = sin_pin;
        gpio->DR_SET = cs_pin;
        gpio->DR_CLEAR = clk_pin;
        gpio->GDIR |= (cs_pin | clk_pin | sin_pin);
        flexspi_sw_delay_us(1);

        for (uint32_t i = 0; i < 4; i++)
        {
            gpio->DR_CLEAR = cs_pin;
            if (!reset_start)
            {
                gpio->DR_CLEAR = sin_pin;
                reset_start = true;
            }
            flexspi_sw_delay_us(1);
            gpio->DR_SET = cs_pin;
            gpio->DR_TOGGLE = sin_pin;
            flexspi_sw_delay_us(1);
        }
    } while (0);
}

//!@brief Get Clock for FlexSPI peripheral
status_t flexspi_get_clock(uint32_t instance, flexspi_clock_type_t type, uint32_t *freq)
{
    uint32_t clockFrequency = 0;
    status_t status = kStatus_Success;

    if ((freq == NULL) || (type > kFlexSpiClock_IpgClock))
    {
        return kStatus_InvalidArgument;
    }

    if ((instance != kFlexspiInstance_1) && (instance != kFlexspiInstance_2))
    {
        return kStatus_InvalidArgument;
    }

    uint32_t seralRootClkDivider;

#ifndef BL_TARGET_FPGA
    switch (type)
    {
        case kFlexSpiClock_CoreClock:
            clockFrequency = CLOCK_GetFreq(kCLOCK_CpuClk);
            break;
        //        case kFlexSpiClock_AhbClock:
        //        {
        //            // Note: In I.MXRT1060, actual AHB clock is IPG_CLOCK_ROOT
        //            clockFrequency = CLOCK_GetFreq(kCLOCK_IpgClk);
        //            debug_printf("BootROM: AHB Clock = %dMHz\n", clockFrequency / FREQ_1MHz);
        //        }
        //        break;
        case kFlexSpiClock_SerialRootClock:
        {
            uint32_t srcRootClk;
            uint32_t flexspiClkSrc = 0;
            uint32_t flexspiClkDiv = 0;
            volatile uint32_t *clkDivRegister = NULL;
            if (instance == kFlexspiInstance_1)
            {
                clkDivRegister = &CCM->CLOCK_ROOT[kCCM_ClockRootIndex_FLEXSPI1].CONTROL;
            }
            else if (instance == kFlexspiInstance_2)
            {
                clkDivRegister = &CCM->CLOCK_ROOT[kCCM_ClockRootIndex_FLEXSPI2].CONTROL;
            }
            // FLEXPI CLK SEL
            flexspiClkSrc = (*clkDivRegister & CCM_CONTROL_MUX_MASK) >> CCM_CONTROL_MUX_SHIFT;
            // FLEXSPI CLK DIV
            flexspiClkDiv = 1 + ((*clkDivRegister & CCM_CONTROL_DIV_MASK) >> CCM_CONTROL_DIV_SHIFT);

            switch (flexspiClkSrc)
            {
                case kFlexSpiClkSrc_RC48M_Div2:
                    srcRootClk = 24000000u;
                    break;
                case kFlexSpiClkSrc_OSC:
                    if (FUSE_BOOT_OSC_REF_VALUE)
                    {
                        srcRootClk = 192000000u;
                    }
                    else
                    {
                        srcRootClk = 24000000u;
                    }
                    break;
                case kFlexSpiClkSrc_RC400M:
                    srcRootClk = 400000000u;
                    break;
                case kFlexSpiClkSrc_RC4M_16M:
                    srcRootClk = 16000000u;
                    break;
                case kFlexSpiClkSrc_PLL_480_PFD0:
                    srcRootClk = 664620000u;
                    break;
                case kFlexSpiClkSrc_PLL_528:
                    srcRootClk = 528000000u;
                    break;
                case kFlexSpiClkSrc_PLL_528_PFD2:
                    srcRootClk = 396000000u;
                    break;
                case kFlexSpiClkSrc_PLL_480:
                    srcRootClk = 480000000u;
                    break;
                default:
                    status = kStatus_OutOfRange;
                    break;
            }

            if (status != kStatus_Success)
            {
                break;
            }

            clockFrequency = srcRootClk / flexspiClkDiv;
            debug_printf("BootROM: FlexSPI Serial Root Clock = %dMHz\n", clockFrequency / FREQ_1MHz);
        }
        break;
        default:
            status = kStatus_InvalidArgument;
            break;
    }
#else
    switch (type)
    {
        case kFlexSpiClock_CoreClock:
            clockFrequency = 24000000;
            break;
        case kFlexSpiClock_SerialRootClock:
            clockFrequency = 12000000;
            break;
        default:
            status = kStatus_InvalidArgument;
            break;
    }
#endif

    if (status == kStatus_Success)
    {
        *freq = clockFrequency;
    }

    return status;
}

static void flexspi_nor_jedec_hw_reset(uint32_t instance)
{
    if ((instance != kFlexspiInstance_1) && (instance != kFlexspiInstance_2))
    {
        return;
    }

    volatile GPIO_Type *gpio = NULL;
    uint32_t ss0_pin = 0;
    uint32_t clk_pin = 0;
    uint32_t sin_pin = 0;

    uint32_t pinListIndex = 0;
    if (instance == kFlexspiInstance_2)
    {
        pinListIndex = 2;
    }

    if (FUSE_FLEXSPI_PIN_GROUP_SEL_VALUE)
    {
        pinListIndex += 1;
    }

    const flash_jedec_hw_pin_t *jedecHwResetPin = &k_jedecHwResetPins[pinListIndex];

    // SS0
    IOMUXC->SW_MUX_CTL_PAD[jedecHwResetPin->SS0.muxPadIndex] = jedecHwResetPin->SS0.muxValue;
    IOMUXC->SW_PAD_CTL_PAD[jedecHwResetPin->SS0.muxPadIndex] = GPIO_SW_PAD_CTL_VAL;
    // SCLK
    IOMUXC->SW_MUX_CTL_PAD[jedecHwResetPin->SCLK.muxPadIndex] = jedecHwResetPin->SCLK.muxValue;
    IOMUXC->SW_PAD_CTL_PAD[jedecHwResetPin->SCLK.muxPadIndex] = GPIO_SW_PAD_CTL_VAL;
    // SIN
    IOMUXC->SW_MUX_CTL_PAD[jedecHwResetPin->SIN.muxPadIndex] = jedecHwResetPin->SIN.muxValue;
    IOMUXC->SW_PAD_CTL_PAD[jedecHwResetPin->SIN.muxPadIndex] = GPIO_SW_PAD_CTL_VAL;

    gpio = jedecHwResetPin->SCLK.gpio;
    ss0_pin = jedecHwResetPin->SS0.pinIndex;
    clk_pin = jedecHwResetPin->SCLK.pinIndex;
    sin_pin = jedecHwResetPin->SIN.pinIndex;

    flexspi_jedec_hw_reset(gpio, ss0_pin, clk_pin, sin_pin);
}
//!@brief Configure IOMUX for FlexSPI Peripheral
void flexspi_iomux_config(uint32_t instance, flexspi_mem_config_t *config)
{
    if ((instance != kFlexspiInstance_1) && (instance != kFlexspiInstance_2))
    {
        return;
    }

    uint32_t padSettingIndex = 0;
    if (instance == kFlexspiInstance_2)
    {
        padSettingIndex = 2;
    }
    if (config->controllerMiscOption & FLEXSPI_BITMASK(kFlexSpiMiscOffset_SecondPinMux))
    {
        padSettingIndex += 1;
    }

    const flexspi_pad_data_t *padData = &k_flexspi_pads[padSettingIndex];

    uint32_t csPadCtrlValue = config->csPadSettingOverride ? config->csPadSettingOverride : padData->csPadSetting;
    uint32_t dqsPadCtrlValue = config->dqsPadSettingOverride ? config->dqsPadSettingOverride : padData->dqsPadSetting;
    uint32_t sclkPadCtrlValue =
        config->sclkPadSettingOverride ? config->sclkPadSettingOverride : padData->sclkPadSetting;
    uint32_t dataPadCtrlValue =
        config->dataPadSettingOverride ? config->dataPadSettingOverride : padData->dataPadSetting;

    debug_printf(
        "BootROM: flexspi_iomux_config(), instance=%x, csPadCtrl=%x, dqsPadCtrl=%x, sclkPadCtl=%x, dataPadCtl=%x\n",
        instance, csPadCtrlValue, dqsPadCtrlValue, sclkPadCtrlValue, dataPadCtrlValue);

    if (config->sflashA1Size || config->sflashA2Size)
    {
        // Configure Chip Select Pin
        if (config->sflashA1Size)
        {
            IOMUXC->SW_MUX_CTL_PAD[padData->A_SS0.muxPadIndex] = padData->A_SS0.muxValue;
            IOMUXC->SW_PAD_CTL_PAD[padData->A_SS0.muxPadIndex] = csPadCtrlValue;
        }
        if (config->sflashA2Size)
        {
            if (padData->A_SS1.muxPadIndex)
            {
                IOMUXC->SW_MUX_CTL_PAD[padData->A_SS1.muxPadIndex] = padData->A_SS1.muxValue;
                IOMUXC->SW_PAD_CTL_PAD[padData->A_SS1.muxPadIndex] = csPadCtrlValue;
            }
        }

        // Configure Clock
        if (padData->A_SCLK.muxPadIndex)
        {
            IOMUXC->SW_MUX_CTL_PAD[padData->A_SCLK.muxPadIndex] =
                (uint32_t)padData->A_SCLK.muxValue | IOMUXC_SW_MUX_CTL_PAD_SION(1);
            IOMUXC->SW_PAD_CTL_PAD[padData->A_SCLK.muxPadIndex] = sclkPadCtrlValue;
        }

        // Configure DATA0-DATA3
        for (uint32_t i = 0; i < 4; i++)
        {
            const flexspi_pad_attribute_t *padAttribute = &padData->A_DATA[i];

            IOMUXC->SW_MUX_CTL_PAD[padAttribute->muxPadIndex] = padAttribute->muxValue;
            IOMUXC->SW_PAD_CTL_PAD[padAttribute->muxPadIndex] = dataPadCtrlValue;
            if (padAttribute->selectInputIndex)
            {
                IOMUXC->SELECT_INPUT[padAttribute->selectInputIndex] = padAttribute->selecctInputValue;
            }
        }

        // Configure Data 4-Data7
        if (config->sflashPadType == kSerialFlash_8Pads)
        {
            if (padData->A_DATA[4].muxPadIndex > 0)
            {
                for (uint32_t i = 4; i < 8; i++)
                {
                    const flexspi_pad_attribute_t *padAttribute = &padData->A_DATA[i];
                    IOMUXC->SW_MUX_CTL_PAD[padAttribute->muxPadIndex] = padAttribute->muxValue;
                    IOMUXC->SW_PAD_CTL_PAD[padAttribute->muxPadIndex] = dataPadCtrlValue;
                    if (padAttribute->selectInputIndex)
                    {
                        IOMUXC->SELECT_INPUT[padAttribute->selectInputIndex] = padAttribute->selecctInputValue;
                    }
                }
            }
        }

        // Configure DQS pad
        if ((config->readSampleClkSrc == kFlexSPIReadSampleClk_ExternalInputFromDqsPad) ||
            (config->readSampleClkSrc == kFlexSPIReadSampleClk_LoopbackFromDqsPad))
        {
            const flexspi_pad_attribute_t *dqsPadAttr = NULL;
            if (config->controllerMiscOption & FLEXSPI_BITMASK(kFlexSpiMiscOffset_SecondDqsPinMux))
            {
                dqsPadAttr = &k_flexspi1_A_DQS3;
                // Override the pad setting for this option
                dqsPadCtrlValue =
                    config->dqsPadSettingOverride ? config->dqsPadSettingOverride : IOMUXC_SW_PAD_CTL_PAD_EMC_PULL(2);
            }
            else
            {
                dqsPadAttr = &padData->A_DQS;
            }

            // FLEXSPIA_DQS
            if ((dqsPadAttr != NULL) && dqsPadAttr->muxPadIndex)
            {
                IOMUXC->SW_MUX_CTL_PAD[dqsPadAttr->muxPadIndex] =
                    (uint32_t)dqsPadAttr->muxValue | IOMUXC_SW_MUX_CTL_PAD_SION(1);
                IOMUXC->SW_PAD_CTL_PAD[dqsPadAttr->muxPadIndex] = dqsPadCtrlValue;
                if (dqsPadAttr->selectInputIndex)
                {
                    IOMUXC->SELECT_INPUT[dqsPadAttr->selectInputIndex] = dqsPadAttr->selecctInputValue;
                }
            }
        }

        // Configure Differential Clock pin
        if (flexspi_is_differential_clock_enable(config))
        {
            if (padData->A_SCLKB.muxPadIndex)
            {
                IOMUXC->SW_MUX_CTL_PAD[padData->A_SCLKB.muxPadIndex] =
                    (uint32_t)padData->A_SCLKB.muxValue | IOMUXC_SW_MUX_CTL_PAD_SION(1);
                IOMUXC->SW_PAD_CTL_PAD[padData->A_SCLKB.muxPadIndex] = sclkPadCtrlValue;
                if (padData->A_SCLKB.selectInputIndex)
                {
                    IOMUXC->SELECT_INPUT[padData->A_SCLKB.selectInputIndex] = padData->A_SCLKB.selecctInputValue;
                }
            }
        }
    } // if (config->sflashA1Size || config->sflashA2Size)

    if (config->sflashB1Size || config->sflashB2Size)
    {
        // Configure Chip Select Pin
        if (config->sflashB1Size)
        {
            if (padData->B_SS0.muxPadIndex)
            {
                IOMUXC->SW_MUX_CTL_PAD[padData->B_SS0.muxPadIndex] = padData->B_SS0.muxValue;
                IOMUXC->SW_PAD_CTL_PAD[padData->B_SS0.muxPadIndex] = csPadCtrlValue;
            }
        }
        if (config->sflashB2Size)
        {
            if (padData->B_SS1.muxPadIndex)
            {
                IOMUXC->SW_MUX_CTL_PAD[padData->B_SS1.muxPadIndex] = padData->B_SS1.muxValue;
                IOMUXC->SW_PAD_CTL_PAD[padData->B_SS1.muxPadIndex] = csPadCtrlValue;
            }
        }

        // Only configure the remaining pads if the pad setting is available on the SoC
        if (padData->B_SS0.muxPadIndex || padData->B_SS1.muxPadIndex)
        {
            // Configure Clock
            if (padData->B_SCLK.muxPadIndex)
            {
                IOMUXC->SW_MUX_CTL_PAD[padData->B_SCLK.muxPadIndex] =
                    (uint32_t)padData->B_SCLK.muxValue | IOMUXC_SW_MUX_CTL_PAD_SION(1);
                IOMUXC->SW_PAD_CTL_PAD[padData->B_SCLK.muxPadIndex] = sclkPadCtrlValue;
            }

            // Configure DATA0-DATA3
            for (uint32_t i = 0; i < 4; i++)
            {
                const flexspi_pad_attribute_t *padAttribute = &padData->B_DATA[i];
                IOMUXC->SW_MUX_CTL_PAD[padAttribute->muxPadIndex] = padAttribute->muxValue;
                IOMUXC->SW_PAD_CTL_PAD[padAttribute->muxPadIndex] = dataPadCtrlValue;
                if (padAttribute->selectInputIndex)
                {
                    IOMUXC->SELECT_INPUT[padAttribute->selectInputIndex] = padAttribute->selecctInputValue;
                }
            }

            // Configure Data 4-Data7
            if (config->sflashPadType == kSerialFlash_8Pads)
            {
                if (padData->B_DATA[4].muxPadIndex > 0)
                {
                    for (uint32_t i = 4; i < 8; i++)
                    {
                        const flexspi_pad_attribute_t *padAttribute = &padData->B_DATA[i];
                        IOMUXC->SW_MUX_CTL_PAD[padAttribute->muxPadIndex] = padAttribute->muxValue;
                        IOMUXC->SW_PAD_CTL_PAD[padAttribute->muxPadIndex] = dataPadCtrlValue;
                        if (padAttribute->selectInputIndex)
                        {
                            IOMUXC->SELECT_INPUT[padAttribute->selectInputIndex] = padAttribute->selecctInputValue;
                        }
                    }
                }
            }

            // Configure DQS pad
            if ((config->readSampleClkSrc == kFlexSPIReadSampleClk_ExternalInputFromDqsPad) ||
                (config->readSampleClkSrc == kFlexSPIReadSampleClk_LoopbackFromDqsPad))
            {
                // FLEXSPIA_DQS
                if (padData->B_DQS.muxPadIndex)
                {
                    IOMUXC->SW_MUX_CTL_PAD[padData->B_DQS.muxPadIndex] =
                        (uint32_t)padData->B_DQS.muxValue | IOMUXC_SW_MUX_CTL_PAD_SION(1);
                    IOMUXC->SW_PAD_CTL_PAD[padData->B_DQS.muxPadIndex] = dqsPadCtrlValue;
                    if (padData->B_DQS.selectInputIndex)
                    {
                        IOMUXC->SELECT_INPUT[padData->B_DQS.selectInputIndex] = padData->B_DQS.selecctInputValue;
                    }
                }
            }

            // Configure Differential Clock pin
            if (flexspi_is_differential_clock_enable(config))
            {
                if (padData->B_SCLKB.muxPadIndex)
                {
                    IOMUXC->SW_MUX_CTL_PAD[padData->B_SCLKB.muxPadIndex] =
                        (uint32_t)padData->B_SCLKB.muxValue | IOMUXC_SW_MUX_CTL_PAD_SION(1);
                    IOMUXC->SW_PAD_CTL_PAD[padData->B_SCLKB.muxPadIndex] = sclkPadCtrlValue;
                    if (padData->B_SCLKB.selectInputIndex)
                    {
                        IOMUXC->SELECT_INPUT[padData->B_SCLKB.selectInputIndex] = padData->B_SCLKB.selecctInputValue;
                    }
                }
            }
        }
    } // if (config->sflashB1Size || config->sflashB2Size)
}

void flexspi_nor_hw_reset(uint32_t instance, uint32_t reset_logic)
{
    if ((instance != kFlexspiInstance_1) && (instance != kFlexspiInstance_2))
    {
        return;
    }

