nxp-mcuxpresso/sbl/target/evkmimxrt1170/board/mcu_isp/flexspi_config_MIMXRT1171.c
    if (reset_logic == kFlashResetLogic_ResetPin)
    {
        volatile GPIO_Type *gpio = NULL;
        uint32_t pin = 0;

        uint32_t resetPinSel = FUSE_FLEXSPI_RESET_PIN_SEL_VALUE;
        const gpio_pad_data_t *padData = &k_resetPins[resetPinSel];

        IOMUXC->SW_MUX_CTL_PAD[padData->muxPadIndex] = padData->muxValue;
        IOMUXC->SW_PAD_CTL_PAD[padData->muxPadIndex] = FLEXSPI_RESET_PIN_SW_PAD_CTRL_VAL;
        gpio = padData->gpio;
        pin = padData->pinIndex;

        // Output mode
        gpio->GDIR |= (1U << pin);

        // High
        gpio->DR_SET = (1U << pin);
        flexspi_sw_delay_us(250);

        // Low
        gpio->DR_CLEAR = (1U << pin);
        flexspi_sw_delay_us(250);

        // High
        gpio->DR_SET = (1U << pin);
        flexspi_sw_delay_us(500);
    }
    else if (reset_logic == kFlashResetLogic_JedecHwReset)
    {
        flexspi_nor_jedec_hw_reset(instance);
    }

    // Restore to default state
    flexspi_nor_write_persistent(0);
}

void flexspi_sw_delay_us(uint64_t us)
{
    uint32_t ticks_per_us = CLOCK_GetFreq(kCLOCK_CpuClk) / 1000000;
    while (us--)
    {
        register uint32_t ticks = 1 + ticks_per_us / 4;
        while (ticks--)
        {
            __NOP();
        }
    }
}

//!@brief Write FlexSPI persistent content
status_t flexspi_nor_write_persistent(const uint32_t data)
{
    SRC->GPR[2] = data;

    return kStatus_Success;
}
//!@brief Read FlexSPI persistent content
status_t flexspi_nor_read_persistent(uint32_t *data)
{
    *data = SRC->GPR[2];

    return kStatus_Success;
}

//!@brief Get maximum frequency supported by FlexSPI
status_t flexspi_get_max_supported_freq(uint32_t instance, uint32_t *freq, uint32_t clkMode)
{
    status_t status = kStatus_InvalidArgument;
    do
    {
        if (freq == NULL)
        {
            break;
        }

        *freq = (166UL * 1000 * 1000);
        status = kStatus_Success;

    } while (0);

    return status;
}

//!@brief Set FlexSPI failsafe setting
status_t flexspi_set_failsafe_setting(flexspi_mem_config_t *config)
{
    (void)config;

    return kStatus_Success;
}

// Update Clock Source
status_t flexspi_update_clock_source(uint32_t instance, uint32_t source)
{
    status_t status = kStatus_InvalidArgument;

    do
    {
        if ((instance < kFlexspiInstance_1) || (instance > kFlexspiInstance_2) || (source > kFlexSpiClkSrc_PLL_480))
        {
            break;
        }

        volatile uint32_t *clkRootRegister = NULL;
        if (instance == kFlexspiInstance_1)
        {
            clkRootRegister = &CCM->CLOCK_ROOT[kCCM_ClockRootIndex_FLEXSPI1].CONTROL;
        }
        else if (instance == kFlexspiInstance_2)
        {
            clkRootRegister = &CCM->CLOCK_ROOT[kCCM_ClockRootIndex_FLEXSPI2].CONTROL;
        }

        uint32_t expectedRegValue =
            ((*clkRootRegister) & ~CCM_CLOCK_ROOT_CONTROL_MUX_MASK) | CCM_CLOCK_ROOT_CONTROL_MUX(source);
        FLEXSPI_Type *g_flexspiInstances[] = FLEXSPI_BASE_PTRS;
        if (expectedRegValue != *clkRootRegister)
        {
            // Disable FlexSPI before clock switch
            bool needRestoreClock = false;
            if (is_flexspi_clock_enabled(instance))
            {
                g_flexspiInstances[instance]->MCR0 |= FLEXSPI_MCR0_MDIS_MASK;
                flexspi_clock_gate_disable(instance);

                needRestoreClock = true;
            }
            *clkRootRegister = expectedRegValue;

            if (needRestoreClock)
            {
                // Restore FlexSPI after clock switch
                flexspi_clock_gate_enable(instance);
                g_flexspiInstances[instance]->MCR0 &= ~FLEXSPI_MCR0_MDIS_MASK;
            }
        }

        debug_printf("%s, addr=%x, value=%x\n", __func__, (uint32_t)clkRootRegister, *clkRootRegister);

        status = kStatus_Success;

    } while (0);

    return status;
}

//!@brief Configure clock for FlexSPI peripheral
void flexspi_clock_config(uint32_t instance, uint32_t freq, uint32_t sampleClkMode)
{
    debug_printf("%s, instance=%d, freq=%d, sampleClkMode=%d\n", __func__, instance, freq, sampleClkMode);

#if !defined(BL_TARGET_FPGA)
    /*
    According to The clock root definition in RT1170, The PFD clock frequency is fixed.
    To support 30MHz, 50MHz, 60MHz, 80MHz, 100MHz, 120MHz, 133MHz, 166MHz and 200MHz,
    the typical clock configurations is as below:
    PLL528_PFD2 = 396MHz
    PLL480 = 480MHz
    PLL480PFD0 = 664MHz
    RC400M = 400MHz
    PLL528 = 528MHz

    FLEXSPI   30MHz	    50MHz   	   60MHz   	80MHz    100MHz   	    120MHz   133MHz  	166MHz   	 200MHz
    SDR	      PLL480/16 PLL528_PFD2/8  PLL480/6	PLL480/6 PLL528_PFD2/4	PLL480/4 PLL528/4   PLL480PFD0/4 PLL528_PFD2/2
    DDR   	  PLL480/8	PLL528_PFD2/4  PLL480/3	PLL480/3 PLL528_PFD2/2	PLL480/2 PLL528/2	PLL480PFD0/2 PLL528_PFD2/1
    */

    do
    {
        if ((sampleClkMode > kFlexSpiClk_DDR) || (freq < 1))
        {
            break;
        }

        if ((instance != kFlexspiInstance_1) && (instance != kFlexspiInstance_2))
        {
            break;
        }

        volatile uint32_t *clkRootRegister = NULL;
        if (instance == kFlexspiInstance_1)
        {
            clkRootRegister = &CCM->CLOCK_ROOT[kCCM_ClockRootIndex_FLEXSPI1].CONTROL;
        }
        else if (instance == kFlexspiInstance_2)
        {
            clkRootRegister = &CCM->CLOCK_ROOT[kCCM_ClockRootIndex_FLEXSPI2].CONTROL;
        }

        uint32_t freqSrc =
            ((*clkRootRegister) & CCM_CLOCK_ROOT_CONTROL_MUX_MASK) >> CCM_CLOCK_ROOT_CONTROL_MUX_SHIFT;
        debug_printf("%s, addr=%x, value=%x\n", __func__, (uint32_t)clkRootRegister, *clkRootRegister);
        typedef struct
        {
            uint8_t src;
            uint8_t div;
        } flexspi_clk_freq_list_t;
        // Formula: Clock(src) / div
        const flexspi_clk_freq_list_t k_flexspi_clk_list_sdr[2][kFlexSpiSerialClk_200MHz + 1] = {
            {
                { 0, 0 },                           // Reserved
                { kFlexSpiClkSrc_PLL_480, 16 },     // 480MHz / 16       30MHz
                { kFlexSpiClkSrc_PLL_528_PFD2, 8 }, // 396MHz / 8    49.5MHz
                { kFlexSpiClkSrc_PLL_528, 8 },      // 528MHz / 6         66MHz
                { kFlexSpiClkSrc_PLL_480, 6 },      // 480MHz / 6         80MHz
                { kFlexSpiClkSrc_PLL_528_PFD2, 4 }, // 396MHz / 4    99MHz
                { kFlexSpiClkSrc_PLL_480, 4 },      // 480MHz / 4         120MHz
                { kFlexSpiClkSrc_PLL_528, 4 },      // 528MHz / 4         132MHz
                { kFlexSpiClkSrc_PLL_480_PFD0, 4 }, // 666MHz / 4    166MHz
                { kFlexSpiClkSrc_PLL_528_PFD2, 2 }  // 396MHz / 2    198MHz
            },
            {
                { 0, 0 },                      // Reserved
                { kFlexSpiClkSrc_RC400M, 13 }, // 400MHz / 13       30MHz
                { kFlexSpiClkSrc_RC400M, 8 },  // 400MHz / 8         50MHz
                { kFlexSpiClkSrc_RC400M, 6 },  // 400MHz / 6         66MHz
                { kFlexSpiClkSrc_RC400M, 5 },  // 400MHz / 5         80MHz
                { kFlexSpiClkSrc_RC400M, 4 },  // 400MHz / 4         100MHz
                { kFlexSpiClkSrc_RC400M, 3 },  // 400MHz / 3         133MHz
                { kFlexSpiClkSrc_RC400M, 3 },  // 400MHz / 3         133MHz
                { kFlexSpiClkSrc_RC400M, 3 },  // 400MHz / 3         133MHz
                { kFlexSpiClkSrc_RC400M, 2 }   // 400MHz / 2         200MHz
            }
        };
        // Formula: Clock(src) / div / 2
        const flexspi_clk_freq_list_t k_flexspi_clk_list_ddr[2][kFlexSpiSerialClk_200MHz + 1] = {
            {
                { 0, 0 },                           // Reserved
                { kFlexSpiClkSrc_PLL_480, 8 },      // 480MHz / 8 / 2        30MHz
                { kFlexSpiClkSrc_PLL_528_PFD2, 4 }, // 396MHz / 4 / 2   49.5MHz
                { kFlexSpiClkSrc_PLL_528, 4 },      // 528MHz / 4 / 2        66MHz
                { kFlexSpiClkSrc_PLL_480, 3 },      // 480MHz / 3 / 2        80MHz
                { kFlexSpiClkSrc_PLL_528_PFD2, 2 }, // 396MHz / 2 / 2   99MHz
                { kFlexSpiClkSrc_PLL_480, 2 },      // 480MHz / 2 / 2        120MHz
                { kFlexSpiClkSrc_PLL_528, 2 },      // 528MHz / 2 / 2        132MHz
                { kFlexSpiClkSrc_PLL_480_PFD0, 2 }, // 666MHz / 2 / 2   166MHz
                { kFlexSpiClkSrc_PLL_528_PFD2, 1 }  // 396MHz / 2       198MHz
            },
            {
                { 0, 0 },                     // Reserved
                { kFlexSpiClkSrc_RC400M, 6 }, // 400MHz / 6 / 2     33MHz
                { kFlexSpiClkSrc_RC400M, 4 }, // 400MHz / 4 / 2     50MHz
                { kFlexSpiClkSrc_RC400M, 3 }, // 400MHz / 3 / 2     66MHz
                { kFlexSpiClkSrc_RC400M, 3 }, // 400MHz / 3 / 2     66MHz
                { kFlexSpiClkSrc_RC400M, 2 }, // 400MHz / 2 / 2     100MHz
                { kFlexSpiClkSrc_RC400M, 2 }, // 400MHz / 2 / 2     100MHz
                { kFlexSpiClkSrc_RC400M, 2 }, // 400MHz / 2 / 2     100MHz
                { kFlexSpiClkSrc_RC400M, 2 }, // 400MHz / 2 / 2     100MHz
                { kFlexSpiClkSrc_RC400M, 1 }  // 400MHz / 1 / 2     200MHz
            }
        };

        bool isHighSpeedSupported = false;
        uint32_t clkDiv = 1;
        uint32_t clkSrc = 0;
        switch (freqSrc)
        {
            default:
                isHighSpeedSupported = true;
                freqSrc = 0;
                break;
            case kFlexSpiClkSrc_RC400M:
                isHighSpeedSupported = true;
                freqSrc = 1;
                break;
            case kFlexSpiClkSrc_RC48M_Div2:
                clkDiv = 1;
                clkSrc = kFlexSpiClkSrc_RC48M_Div2;
                break;
            case kFlexSpiClkSrc_OSC:
                clkDiv = 1;
                clkSrc = kFlexSpiClkSrc_OSC;
                break;
            case kFlexSpiClkSrc_RC4M_16M:
                clkDiv = 1;
                clkSrc = kFlexSpiClkSrc_RC4M_16M;
                break;
        }

        if (isHighSpeedSupported)
        {
            const flexspi_clk_freq_list_t *freq_list = k_flexspi_clk_list_sdr[freqSrc];
            if (sampleClkMode == kFlexSpiClk_DDR)
            {
                freq_list = k_flexspi_clk_list_ddr[freqSrc];
            }

            if (freq > kFlexSpiSerialClk_200MHz)
            {
                freq = kFlexSpiSerialClk_SafeFreq;
            }
            clkDiv = freq_list[freq].div;
            clkSrc = freq_list[freq].src;
        }

        uint32_t tmpClkRootRegValue = CCM_CONTROL_DIV(clkDiv - 1) | CCM_CONTROL_MUX(clkSrc);

