nxp-mcuxpresso/sbl/target/evkmimxrt1170/board/mcu_isp/flexspi_config_MIMXRT1171.c
        FLEXSPI_Type *g_flexspiInstances[] = FLEXSPI_BASE_PTRS;

        // Disable FlexSPI before clock switch
        if (is_flexspi_clock_enabled(instance))
        {
            g_flexspiInstances[instance]->MCR0 |= FLEXSPI_MCR0_MDIS_MASK;
            flexspi_clock_gate_disable(instance);
        }

        // Update FLEXSPI clock root setting as needed
        if (tmpClkRootRegValue != *clkRootRegister)
        {
            *clkRootRegister = tmpClkRootRegValue;
        }

        debug_printf("%s, address=%x, value=%x\n", __func__, (uint32_t)clkRootRegister, *clkRootRegister);

        // Restore FlexSPI after clock switch
        flexspi_clock_gate_enable(instance);
        g_flexspiInstances[instance]->MCR0 &= ~FLEXSPI_MCR0_MDIS_MASK;

        uint32_t serialRootClk = 0;

        flexspi_get_clock(instance, kFlexSpiClock_SerialRootClock, &serialRootClk);
        debug_printf("BootROM: FlexSPI Clock = %d\n", serialRootClk);

    } while (0);
#endif
}

//!@brief Gate on the clock for the FlexSPI peripheral
void flexspi_clock_gate_enable(uint32_t instance)
{
    volatile uint32_t *reg = NULL;
    if (instance == kFlexspiInstance_1)
    {
        reg = &CCM->LPCG[kCCM_ClockGateIndex_FLEXSPI1].DIRECT;
    }
    else if (instance == kFlexspiInstance_2)
    {
        reg = &CCM->LPCG[kCCM_ClockGateIndex_FLEXSPI2].DIRECT;
    }

    if (reg != NULL)
    {
        *reg = 1;

        debug_printf("%s, address=%x, value=%x\n", __func__, (uint32_t)reg, *reg);
        __DSB();
        __ISB();
    }
}

//!@brief Gate off the clock the FlexSPI peripheral
void flexspi_clock_gate_disable(uint32_t instance)
{
    volatile uint32_t *reg = NULL;
    if (instance == kFlexspiInstance_1)
    {
        reg = &CCM->LPCG[kCCM_ClockGateIndex_FLEXSPI1].DIRECT;
    }
    else if (instance == kFlexspiInstance_2)
    {
        reg = &CCM->LPCG[kCCM_ClockGateIndex_FLEXSPI2].DIRECT;
    }

    if (reg != NULL)
    {
        *reg = 0;

        debug_printf("%s, address=%x, value=%x\n", __func__, (uint32_t)reg, *reg);
        __DSB();
        __ISB();
    }
}

bool is_flexspi_clock_enabled(uint32_t instance)
{
    volatile uint32_t *reg = NULL;
    bool isEnabled = false;
    if (instance == kFlexspiInstance_1)
    {
        reg = &CCM->LPCG[kCCM_ClockGateIndex_FLEXSPI1].DIRECT;
    }
    else if (instance == kFlexspiInstance_2)
    {
        reg = &CCM->LPCG[kCCM_ClockGateIndex_FLEXSPI2].DIRECT;
    }
    if (reg != NULL)
    {
        isEnabled = *reg ? true : false;
    }

    return isEnabled;
}

void flexspi_update_padsetting(flexspi_mem_config_t *config, uint32_t driveStrength)
{
#define IOMUXC_PAD_SETTING_DSE_SHIFT (3)
#define IOMUXC_PAD_SETTING_DSE_MASK (0x07 << IOMUXC_PAD_SETTING_DSE_SHIFT)
#define IOMUXC_PAD_SETTING_DSE(x) (((x) << IOMUXC_PAD_SETTING_DSE_SHIFT) & IOMUXC_PAD_SETTING_DSE_MASK)
    if (driveStrength)
    {
        config->csPadSettingOverride =
            (FLEXSPI_SW_PAD_CTL_VAL & ~IOMUXC_PAD_SETTING_DSE_MASK) | IOMUXC_PAD_SETTING_DSE(driveStrength);
        config->dqsPadSettingOverride =
            (FLEXSPI_DQS_SW_PAD_CTL_VAL & ~IOMUXC_PAD_SETTING_DSE_MASK) | IOMUXC_PAD_SETTING_DSE(driveStrength);
        config->sclkPadSettingOverride =
            (FLEXSPI_SW_PAD_CTL_VAL & ~IOMUXC_PAD_SETTING_DSE_MASK) | IOMUXC_PAD_SETTING_DSE(driveStrength);
        config->dataPadSettingOverride =
            (FLEXSPI_SW_PAD_CTL_VAL & ~IOMUXC_PAD_SETTING_DSE_MASK) | IOMUXC_PAD_SETTING_DSE(driveStrength);
        debug_printf("%s, driveStrength = %x\n", driveStrength);
    }
}

uint32_t get_flexspinor_instance(void)
{
    uint32_t instance = 1 + FUSE_FLEXSPI_INSTANCE_VALUE;
    return instance;
}

uint32_t get_flexspinand_instance(void)
{
    uint32_t instance = 1 + FUSE_FLEXSPI_INSTANCE_VALUE;
    return instance;
}

uint32_t flexspinor_get_phy_addr(uint32_t offset)
{
    uint32_t instance = get_flexspinor_instance();
    uint32_t baseAmbaAddr = (instance == kFlexspiInstance_1) ? FlexSPI1_AMBA_BASE : FlexSPI2_AMBA_BASE;
    return (baseAmbaAddr + offset);
}
